Revit 2026 API

# Transform2DIsConformal Property

---

The boolean value that indicates whether this transformation is conformal.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsConformal { get; }
```
```vb
Public ReadOnly Property IsConformal As Boolean
	Get
```
```cpp
public:
property bool IsConformal {
	bool get ();
}
```
```fsharp
member IsConformal : bool with get
```

#### Property Value

Boolean

This property is true if this transformation can be decomposed as the product of a rigid-body motion, uniform scale and reflection. Such transformation preserves angles between vectors.

#### Reference

Transform2D Class

Autodesk.Revit.DB Namespace